"use strict";

/* 
    SOLID - принципы, которые лежат в основе дизайна постороения приложения в ООП.

    S - Принцип единой ответсвенность (класс должен уметь выполнять одну конретную вещь, но хорошо)
    O - Принцип открытости и закрытости (класс должен быть открыт к дополнению, но закрыт к модификации)
    L - Принцип подстановки Барбары Лисков (дочерний класс может заменить родительский)
    I - Принцип разделения интерфейса (интерфейс должен описывать только то, что действительно нужно и не зависеть от методов и свйоств, которые не отвечают конретно за эту область)
    D - Принцип инверсии зависимостей (Болле общие классы не должны зависеть от частных низкоуровневых классов)
*/
